import React from 'react'
import styles from './course_detail.module.css'

const AboutMe = () => {
    return (
        <div className={styles.aboutMeField}>
            <p style={{fontWeight: 'bold'}}>Իմ մասին</p>
            <p>
                Դուք կմասնակցեք առօրյա իրավիճակներին, որտեղ կարող եք գործնականում կիրառել Ձեր բանավոր, հաղորդակցության
                հմտությունները և սահուն տիրապետել:
                Այն աշխարհի ամենաշատ օգտագործվող լեզուն է, ուստի անգլերենի իմացությամբ դուք կբարելավեք Ձեր կարիերան և
                անձնական հնարավորությունները:
                Դուք հեշտությամբ կտիրապետեք անգլերեն բանավոր խոսքին, քանի որ այբուբենը պարզ է և, ի տարբերություն
                հայերենի, հարուստ չէ շատ ժամանակաձևերով:
            </p>
        </div>
    )
}

export default AboutMe